--[[ 
    _____    _        _    _    _____    Dev @lIMyIl 
   |_   _|__| |__    / \  | | _| ____|   Dev @li_XxX_il 
     | |/ __| '_ \  / _ \ | |/ /  _|     Dev @h_k_a 
     | |\__ \ | | |/ ___ \|   <| |___    Dev @Aram_omar22 
     |_||___/_| |_/_/   \_\_|\_\_____|   Dev @IXX_I_XXI 
              CH > @lTSHAKEl_CH 
--]] 
do 
function run(msg, matches) 
 if matches[1] == "الاوامر" and is_momod(msg) then 
    return " Hi☺️~ "..msg.from.first_name.."\n" 
  .."  ".."\n" 
  ..[[ 
⏺ اوامر البوت THE GUARD
|🏵| -------------------------- |🏵| 
◽️ م1 | لعرض اوامر الادمنيه و المدير💡
◽️ م2 | لعرض اوامر الميديا💡
◽️ م3 | لعرض اوامر حماية 💡
◽️ م4 | لعرض اوامر بالتحذير💡
◽️ م5 | لعرض اوامر المجموعه 💡
▫️ م6 | لعرض اوامر المطورين 💡
]].."\n" 
.."|🏵| -------------------------- |🏵|".."\n" 
..'|🏵| CH | @arabic_android '..'\n' 
------------------ 

  elseif matches[1] == "م1" and is_momod(msg) then 
    return " Hi☺️~ "..msg.from.first_name.."\n" 
  .."  ".."\n" 
  ..[[ 
🔰 اوامر تـخص الادمنيـه و المـديـر 🔰 
|🏵| -------------------------- |🏵| 
🔺- /add mod:- لرفع ادمن
🔺- /del mod :- لتنزيل ادمن
🔺- /add admin:- لرفع اداري
🔺- /del admin:- لتنزيل اداري
🔺-️ /ban :- لحظر العضو
🔺-️ /unban :- لأزاله الحظر
🔺- /bw :- لمنع كلمه
🔺- /ubw :- لالغاء منع كلمه 
🔺- /lbw :- لضهار الكلمات الممنوعه
🔺- /clbw :- لحذف الكلمات الممنوعه
🔺-️ /id :- لعرض ايدي المجموعه
🔺- /id :- لعرض ايدي العضو بلرد
🔺- /sil :- لكتم عضو
🔺- /list sil :- لظهار المكتومين
🔺- /bots :- لضهار بوتات api
🔺- /owner :- لظهار مدير المجموعه
🔺- /mods :- لظهار الادمنيه
🔺- /admins :- لظهار الادارين
🔺- /cl :- لحذف رساله بلرد
🔺- /who :- لظهار اعضاء المجموعه
]].."\n" 
.."|🏵| -------------------------- |🏵|".."\n" 
..'|️🏵|CH | @arabic_android '..'\n' 
------------------ 

  elseif  matches[1] == "م2" and is_momod(msg) then 
    return " Hi☺️~ "..msg.from.first_name.."\n" 
  .."  ".."\n" 
  ..[[ 
 ✔️ اوامـر قــفـل و فــتـح الــميديـا ✔️ 
|🏵| -------------------------- |🏵| 
✅ /c لقفل الامر
❗️ /o لفتح الامر
|🏵| -------------------------- |🏵| 

🎈- au :- الصوتيات |🔊
🎈- ph :- الصور|🌠
🎈- vi :- الفديوهات|🎥
🎈- gi :- الصور المتحركه|🃏
🎈- dc :- الملفات|🗂
🎈- gp :- المجموعه|📢
🎈- tx :- الدردشه|📇

]].."\n" 
.."|🏵| -------------------------- |🏵|".."\n" 
..'|️🏵| CH | @arabic_android '..'\n' 
------------------ 

  elseif  matches[1] == "م3" and is_momod(msg) then 
    return " Hi☺️~ "..msg.from.first_name.."\n" 
  .."  ".."\n" 
  ..[[ 
📛اوامـــر حمـــايه الـــمجمـــوعه📛 
|🏵| -------------------------- |🏵| 
✅ /c لقفل الامر
⚠️ /o لفتح الامر
|🏵| -------------------------- |🏵| 

🎈- lk :- الروابط |♻️
🎈- sp :- السبام|🚸
🎈- fl :- التكرار|🔖
🎈- ar :- العربيه|🆎
🎈- mb :- الاعضاء|👥
🎈- rt :- الرتل|⚠️
🎈- st :- الملصقات|🏟
🎈- ct :- جهات الاتصال|📩
🎈- kc :- الطرد|🚷
🎈- us :- المعرف|🌀
🎈- ej :- الايموجي|😃
🎈- tg :- التاك|📥
🎈- fd :- اعاده توجيه|↪️
🎈- cm :- الشارحه|〰
🎈- ts :- الاشعارات|🚏
🎈- jo :- الدخول بالرابط|📍
🎈- bt :- البوتات|👾
🎈- en :- الانكلش|🆘
🎈- alk :- جميع الروابط|🔕
  ]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH'..'\n'
------------------


 elseif  matches[1] == "hg" and is_momod(msg) then 
    return "Hi☺️~"..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🔹- اوامــر تــخــص  المـجـمـوعـه 👁‍🗨
🔸--------------------------🔹
🔺-️ /set ph :- لوضع صوره للمجموعه
🔺- /set ru :- لوضع قوانين
🔺- /ru :- لضهار القوانين
🔺-️ /set ab :- لوضع وصف للمجموعه
🔺- /set na :- لوضع اسم للمجموعه
🔺- /set us :- لوضع معرف للمجموعه
🔺-️ /set lk :- لحفظ رابط المجموعه
🔺- /lk :- اظهار رابط المجموعه 
🔺- /set fl :- لتحديد التكرار {5-20}
🔺-️ /info :- لضهار معلوماتك
🔺- /gp info :- لضهار معلومات المجموعه
🔺- /s :- لضهار معلومات المجموعه
🔺- /setwlc لوضع ترحيب 
🔺- /delwlc لحذف الترحيب
🔸--------------------------🔹
🔺- /cl :- لحذف ⤵️
🔺- ru :- القوانين
🔺- ab :- الوصف
🔺- us :- المعرف
]].."\n" 
.."|🏵| -------------------------- |🏵|".."\n" 
..'|️🏵| CH | @arabic_android '..'\n' 
------------------ 

  elseif  matches[1] == "م4" and is_momod(msg) then 
    return " Hi☺️~"..msg.from.first_name.."\n" 
  .."  ".."\n" 
  ..[[ 
✔️ اوامـر قــفـل و فتـح بالتـحـذيـر ✔️ 
|🏵| -------------------------- |🏵| 
✅ /warn لقفل الامر
⚠️ /unwarn لفتح الامر
|🏵| -------------------------- |🏵| 
|▫️|links |♻️ 
|▫️| fwd |↪️ 
|▫️| photo |🌠 
|▫️|audio |🔊 
|▫️|video |🎥 
|▫️| chat |📇 
|▫️|username |🌀 
|▫️| cmd |〰 
|▫️| inline |📡 
|▫️| tag |📥 
|▫️|smile |😃 
|▫️| media |📬 
]].."\n" 
.."|🏵| -------------------------- |🏵|".."\n" 
..'|🏵| CH | @arabic_android '..'\n' 

------------------------ 

 elseif  matches[1] == "م5" and is_momod(msg) then 
    return " Hi☺️~ "..msg.from.first_name.."\n" 
  .."  ".."\n" 
  ..[[ 
🔹- اوامــر تــخــص  المـجـمـوعـه 👁‍🗨 
|🏵| -------------------------- |🏵| 
|▫️| ضع صوره 
|▪️| لوضع صوره 
|▫️| ضع قوانين 
|▪️| لوضع قوانين 
|▫️| ضع وصف 
|▪️| لوضع وصف 
|▫️| ضع اسم 
|▪️| لوضع اسم 
|▫️| ضع  معرف 
|▪️| لوضع معرف 
|▫️| ضع رابط 
|▪️| لخزن رابط المجموعه 
|▫️| الرابط 
|▪️| لعرض رابط المجموعه 
|▫️| معلوماتي 
|▪️| لعرض معلوماتك 
|▫️| معلومات المجموعه 
|▪️| لعرض معلومات المجموعه 
|▫️| اعدادت الوسائط 
|▪️| لاضهار الاعدادات الوسائط 
]].."\n" 
.."|🏵| -------------------------- |🏵|".."\n" 
..'|️🏵| CH | @arabic_android '..'\n' 
----------------------- 

 elseif  matches[1] == "م6" and is_sudo(msg) then 
    return "Hi☺️~"..msg.from.first_name.."\n" 
  .."  ".."\n" 
  ..[[ 
  💡| اوامـــر المــطـــوريـــن  ⚙ 
|🏵| -------------------------- |🏵| 

🕋- /add :- لتفعيل البوت
🕋- /rem :- لتعطيل البوت
🕋- /add owner :- لرفع مدير
🕋- /br :- لذاعه شئ في المجموعات
🕋- /kb :- لطرد البوت من المجموعه
🕋- /send :- لجلب ملف من السيرفر    
🕋- /cg :- لصنع مجموعه
🕋- /tosuper :- لترقيه المجموعه
🕋- /set time :- لوضع وقت للبوت
🕋- /time :- لمعرفه وقت تفعيل البوت
🕋- /pall :- لعرض الملفات
🕋- /p ac :- لتفعيل ملف 
🕋- /p an :- لتعطيل ملف
🕋- /p a :- الملفات المثبته
]].."\n" 
.."|🏵| -------------------------- |🏵|".."\n" 
..'|️🏵| CH | @arabic_android '..'\n' 
------------------ 
  end 
end 
return { 
  patterns = { 
    "^(help)", 
    "^(h1)", 
    "^(h2)", 
    "^(h3)", 
    "^(h4)", 
    "^(h5)", 
    "^(h6)", 
    "^[#!/](help)", 
    "^[#!/](h1)", 
    "^[#!/](h2)", 
    "^[#!/](h3)", 
    "^[#!/](h4)", 
    "^[#!/](h5)", 
    "^[#!/](h6)" 
  }, 
  run = run 
} 
end 

--[[ 
    _____    _        _    _    _____    Dev @lIMyIl 
   |_   _|__| |__    / \  | | _| ____|   Dev @li_XxX_il 
     | |/ __| '_ \  / _ \ | |/ /  _|     Dev @h_k_a 
     | |\__ \ | | |/ ___ \|   <| |___    Dev @Aram_omar22 
     |_||___/_| |_/_/   \_\_|\_\_____|   Dev @IXX_I_XXI 
              CH > @lTSHAKEl_CH 
--]]
