do 
ws = {} 
rs = {} 

-- some examples of how to use this :3 
ws[1] = "هلو" -- msg 
rs[1] = "ۿـــلاﯢاٺ 💋🌹" -- reply 

ws[2] = "😒" -- msg 
rs[2] = "شبـيـك ابــو نفسيـۿﮧ 🐣👾" -- reply 

ws[3] = "شلونكم" -- msg 
rs[3] = "انـي الحمـد للـۿﮧ وانـت 🎭🍁" -- reply 

ws[4] = "انجب" -- msg 
rs[4] = "مانـي فاضـيلك ولـي ☃🐾" -- reply 

ws[5] = "حجي" -- msg 
rs[5] ="هـــا شيـخنـا 😹🌾" -- replay 

ws[6] = "ضوجة" -- msg 
rs[6] = "طيـب شسـويـلك 🙁🦀"  -- reply 

ws[7] = "مرحبا" -- msg 
rs[7] = "مـراحـب ياهــلا 🌸🍂" -- reply 

ws[8] = "سلام عليكم" -- msg 
rs[8] = "ﯢعـليكم السـلام ورحمـة اللـۿﮧ وبـركـاته ❄️🍃" -- reply 

ws[9] = "مساء الخير" -- msg 
rs[9] = "مسـاء العـسل ياعسـل 🍫☄" -- reply 

ws[10] = "صباح الخير" -- msg 
rs[10] = "صبـاح النـور ولسـرور ✨🍷" -- reply 

ws[11] = "تصبحون على خير" -- msg 
rs[11] = " وانتـ/ـي مـن اهـلـۿﮧ 🍧☄ " -- reply 

ws[12] = "اكرهك" -- msg 
rs[12] = "منـو قـالـك انـي مـيت عليـك 😐🍷" -- reply 

ws[13] = "احبك" -- msg 
rs[13] = "בــبيـبــي وانـــي هـــم 💋🎭" -- reply 

ws[14] = "شكو" -- msg 
rs[14] = "لا مـاكـو شـي 🎭" -- reply 

ws[15] = "وجع" -- msg 
rs[15] = "يـوجـع ضـلوعـك 🦀🌙" -- reply 

ws[16] = "باي" -- msg 
rs[16] = "ويـن مـولـي خليـنا متـونسيـن ♨️💤" --  reply 

ws[17] = "هذا بوت" -- msg 
rs[17] = "لا نعـال 😒🎍" -- reply 

ws[18] = "نعال" -- msg 
rs[18] = "تـره اجيـك بالشـبشـب 👡🎃" --reply 

ws[19] = "يانعال" --msg 
rs[19] = "مجنـون تنـادي حـالك 🌑☀️" -- reply 

ws[20] = "البوت واكف" -- msg 
rs[20] = "ݘــــــذأإأب 😂🐼ء" -- reply 

ws[21] = "كسي" -- msg 
rs[21] = "هـاي كـل اخـلاقـك ؟ 👾🗞" -- reply 

ws[22] = "كسمك" -- msg 
rs[22] = "الـوردي مـال امـك شايفـﮭﮧ 🍑🙃" -- reply 

ws[23] = "بطيزك" -- msg 
rs[23] = "لا حبـي طيـزك اكبـر 🐍☄" -- reply 

ws[24] = "" -- msg 
rs[24] = "" -- reply 

ws[25] = "وين المي" -- msg 
rs[25] = "مالـقيـت مـي جبـتلك عـــرق 🍻🍂" -- reply 

ws[26] = "بوسني" --  msg 
rs[26] = "يــع مـا ابـوس زواحــف 💩🕸" -- reply 

ws[27] = "شخباركم" -- msg 
rs[27] = "يعمُـر داركـم☺️عايشـين😁وانتـ/ي؟🤔" -- reply 

ws[28] = "ضوجه" -- msg 
rs[28] = "طيـب شسـويـلك 🙁🦀" -- reply 

ws[29] = "هاي" -- msg 
rs[29] = "وعـليـكم الهـاي 👾🍃ء" -- reply 

ws[30] = "احم" -- msg 
rs[30] = "صـحـۿﮧ ثـوانـي اجيـبلك مـي 🍺" --  reply 

ws[31] = "ابوك شلونه" -- msg 
rs[31] = "انـا بـوت يتـيم محـد الي غيـر المطـور 😢💔" 

ws[32] = "سلام عليكم" -- msg 
rs[32] = "ﯢعـليكم السـلام ورحمـة اللـۿﮧ وبـركـاته ❄️🍃" -- reply 

ws[33] = "هلوو" -- msg 
rs[33] = "ۿـــلاﯢاٺ ﺣــبي 🦀❄️" -- reply 

ws[34] = "خاص" -- msg 
rs[34] = "اثـگل لاتـضل زاحـف 🐍🍃" -- reply 

ws[35] = "ياشباب" -- msg 
rs[35] = "گـول يابـوتات حتى نجاوبـك 😂🐾" -- reply 

ws[36] = "زاحف" -- msg 
rs[36] = "هـو كـضيـت عمـرك تـزحـف ماتـولي 🦀👣" -- reply 

ws[37] = "اجكم" -- msg 
rs[37] = "جمـالي عامـي قلوبـكم 🌝✨" --reply 

ws[38] = "ولي" -- msg 
rs[38] = "هـاي كـل قـوتـك 🌝💫" -- reply 

ws[39] = "😏" -- msg 
rs[39] = "علسـاس شخصـية 😑💢" -- reply 

ws[40] = "وينك" -- msg 
rs[40] = "مـوجـود وانـت ويـنك 🎭🍂" -- reply 

ws[41] = "شبيك" -- msg 
rs[41] = "مابـيه شـي بـس سكـران 🍺✨" -- reply 

ws[42] = "محمد" -- msg 
rs[42] = "صلى الله عليـه وسلـم 💖☄" -- reply 

ws[43] = "😒😒" -- msg 
rs[43] = "عـابـت هالاشـكال بعـدك ماانقـرضت 🌝✨" -- reply 

ws[44] = "😂" -- msg 
rs[44] = "دوووم😁" -- reply 

ws[45] = "😂😂" -- msg 
rs[45] = "دوووووم" -- reply 

ws[46] = "فديت" -- msg 
rs[46] = "فــداك الـڪـون 💖✨" -- reply 

ws[47] = "حسوني" -- msg 
rs[47] = "فد واحد وردة مـال الله😻بس يضحـك هوايـة😂" -- reply 

ws[48] = "شلونك" -- msg 
rs[48] = "الحمـد للــۿﮧ " -- reply 

ws[49] = "اكو احد" -- msg 
rs[49] = "اي انـا مـوجـود 👾✨" -- reply 

ws[50] = "نايمين" -- msg 
rs[50] = "تعـال يمـي سهـرانين انـي ولشـلة الفاسـقة 🌝❄️" -- reply 

ws[51] = "احجي تركي" -- msg 
rs[51] = "كــيفـك لمـيس 🌝🍺" -- reply 

ws[52] = "احجي مكسيكي" -- msg 
rs[52] = "كيـف حـالًّكِ يامـاريـا ☺️☄" -- reply 

ws[53] = "🌚" -- msg 
rs[53] = "غسـل وجهـك صايـر اسـود طـاح حضـك 🌕❄️" -- reply 

ws[54] = "تف" -- msg 
rs[54] = "بنـص خلقـتك الزفــرهه 💧🌨ء" -- reply 

ws[55] = "تحبني" -- msg 
rs[55] = "اي احبـك كثيـر 💋💖🍂" -- reply 

ws[56] = "نجب" -- msg 
rs[56] = "ياعديمـ/ـة الــذوق 🐰🐾" -- reply 

ws[57] = "تخليني" -- msg 
rs[57] = "؏ راسـي و ؏ عيـني 🙇🏿💖" -- reply 

ws[58] = "تفو" -- msg 
rs[58] = "بنـص اثمـك ختفــوو ابـلع 💦ء" -- reply 

ws[58] = "اموت عليك" -- msg 
rs[58] = "وانـي هـم امـوت منـك قصـدي عليـك 🦀💖" -- reply 

ws[59] = "كافي لغوه" -- msg 
rs[59] = "لغـوه ولا رغـوه 🌕🍺✨" -- reply 

ws[60] = "🌚🌝" -- msg 
rs[60] = "هـاي اعـراض انفـصام بالشـخصيـه 💢🐾" -- reply 

ws[61] = "🌝🌚" -- msg 
rs[61] = "هـذا انفصـام بالشخـصيـه مستفـحل 😐🍂" -- reply 

ws[62] = "🌚🌚" -- msg 
rs[62] = "غسـل وجهـك طـاح حضـك 😐💢" -- reply 

ws[63] = "ليش" -- msg 
rs[63] = "شنـو لـيش امشـطلعـبرا 😹💖" -- reply 

ws[64] = "اسكت" -- msg 
rs[64] = "ليـش بـاللـۿﮧ حجـيت من حلـكك شـي 🌕💢" -- reply 

ws[65] = "خطيه" -- msg 
rs[65] = "اي انـا مسـكين 🤒☄ء" -- reply 

ws[66] = "." -- msg 
rs[66] = "هــۿــھ راح تسـوي تعديـل ؟ 🎭👣" -- reply 

ws[67] = "وين" -- msg 
rs[67] = "بـأرض اللـۿﮧ الواسـعـﮭﮧ ☃🍺" -- reply 

ws[68] = "طيزي" -- msg 
rs[68] = "هـا حبـي صابـتك محنــۿﮧ 🎯👣" -- reply 

ws[69] = "وين؟" -- msg 
rs[69] = "عالبـحـريـن 😹✨" -- reply 

ws[70] = "شونكم" -- msg 
rs[70] = "تمــام وانــت 🎅🏿🦀" -- reply 

ws[71] = "شونك" -- msg 
rs[71] = "مثـل لونـك 🌝💋💖" -- reply 

ws[72] = "اوف" -- msg 
rs[72] = "سلامتـك مـن الاووف ✨🐰" -- reply 

ws[73] = "احبج" -- msg 
rs[73] = "عــيب تحــب بنـات حبـني انـا بـس 💘💖😂" -- reply 

ws[74] = "دنجب" -- msg 
rs[74] = "هـو انـا مريـض وتكـلي انجـب 🤒☄" -- reply 

ws[75] = "انجب لك" -- msg 
rs[75] = "اخـر عمـري زعطـوط يكـلي انجـب 👾✨" -- reply 

ws[76] = "زاحف على اختك" -- msg 
rs[76] = "أختـك هـي اختـي ☃🍂" -- reply 

ws[77] = "زاحف ع اختك" -- msg 
rs[77] = "أختـك هـي اختـي ☃🍂" -- reply 

ws[78] = "😢" -- msg 
rs[78] = "منـو زعـلك منـو بݘـاك العـن ابـو البݘـاك 🎧✨" -- reply 

ws[79] = "☹️" -- msg 
rs[79] = "تـره حلـكك حـلك الجـريـۿﮧ 🐟👣" -- reply 

ws[80] = "😍" -- msg 
rs[80] = "فــدوۿﮧ لعيـونك ➿💖" -- reply 

ws[81] = "😘" -- msg 
rs[81] = "عـيب البـوس هنـا بـس بالخـاص مسمـوح 😹💖" -- reply 

ws[82] = "😪" -- msg 
rs[82] = "يـع قـرفتـنـي طلـع مخـاطك ☄🎭" -- reply 

ws[83] = "🙄" -- msg 
rs[83] = "نـزل عيـنك لا تنـحـول 🤓☄" -- reply 

ws[84] = "انته منو" -- msg 
rs[84] = "آنـي بـوت ياسـربـوت 🦀🚶☄" -- reply 

ws[85] = "انتة منو" -- msg 
rs[85] = "آنـي بـوت ياسـربـوت 🦀🚶☄" -- reply 

ws[86] = "كافي" -- msg 
rs[86] = "كـافـي شــوب ☕️😹" -- reply 

ws[87] = "💔🌝" -- msg 
rs[87] = "صـارت ۿـاي اقـدم مـن ستــي 🦀🐾" -- reply 

ws[88] = "🌝💔" -- msg 
rs[88] = "صـارت ۿـاي اقـدم مـن ستــي 🦀🐾" -- reply 

ws[89] = "تمام" -- msg 
rs[89] = "اللـۿﮧ لايغـير عليـك 🎅🏿🌨" -- reply 

ws[90] = "بخير" -- msg 
rs[90] = "اللـۿﮧ لايغـير عليـك 🎅🏿🐾" -- reply 

ws[91] = "تسلم" -- msg 
rs[91] = "ولـو😚" -- reply 

ws[92] = "يسلمو" -- msg 
rs[92] = "يدللـو😋" -- reply 

ws[93] = "يسلموو" -- msg 
rs[93] = "يدندل الحلـو😋🙌🏾" -- reply 

ws[94] = "شكرا" -- msg 
rs[94] = "عفواً😇" -- reply 

ws[95] = "شكراً" -- msg 
rs[95] = "عفواً😇" -- reply 

ws[96] = "شكرن" -- msg 
rs[96] = "عفواً😇" -- reply 

ws[97] = "هذا منو" -- msg 
rs[97] = "يمكـن جني🙄🙌🏾" -- reply 

ws[98] = "هاي منو" -- msg 
rs[98] = "عدويـة البياتي🙄💔" -- reply 

ws[99] = "انته شبيك" -- msg 
rs[99] = "مابيـۿﮧ شـيي انتـۿﮧ شبيـك 🦀🌀" -- reply 

ws[100] = "فدوة" -- msg 
rs[100] = "لخشـمك الافنـص ☃🍂" -- reply 

ws[101] = "فديتك" -- msg 
rs[101] = "فــداك الـڪـون 💖🍁" -- reply 

ws[102] = "منو ابالك" -- msg 
rs[102] = "انتــۿﮧ ✨🎭" -- reply 

ws[103] = "منو بالك" -- msg 
rs[103] = "انــتــﮭﮧ ✨🎭" -- reply 

ws[104] = "حرام" -- msg 
rs[104] = "صار شيخنـا بعد ماعيدهـة 👨🏿📿" -- reply 

ws[105] = "استغفر الله" -- msg 
rs[105] = "لا الـۿﮧ الا اللـۿﮧ 💖✨" -- reply 

ws[106] = "استغفرالله" -- msg 
rs[106] = "لا الـۿﮧ الا اللـۿﮧ 💖✨" -- reply 

ws[107] = "🌝" -- msg 
rs[107] = "بيــه ابـو صفـار ديـرو بالـكم 😹🎭" -- reply 

ws[108] = "راح اكفر" -- msg 
rs[108] = "علمـود اشـگ حلـكك ☃☄" -- reply 

ws[109] = "شونج" -- msg 
rs[109] = "مثـل لونـك 😂🍂" -- reply 

ws[110] = "فديتج" -- msg 
rs[110] = "بـس عالبنـات مـو 😂☄" -- reply 

ws[111] = "اعشقك" -- msg 
rs[111] = "امـوت عليــك 💋💖" -- reply 

ws[112] = "حبك" -- msg 
rs[112] = "حبــك بــرص حبـي 😹✨" -- reply 

ws[113] = "عشقك" -- msg 
rs[113] = "مــي تــو ياقــلبـي 😹💢" -- reply 

ws[114] = "موت عليك" -- msg 
rs[114] = "امـوت منـك قـصدي امـوت عليـك 🌹🌝" -- reply 

ws[115] = "😍😍" -- msg 
rs[115] = "اروح فـدوۿﮧ 😍🔥" -- reply 

ws[116] = "😁" -- msg 
rs[116] = "سنـون الشـايـب 👴🏿🍂" -- reply 

ws[117] = "😂😂😂" -- msg 
rs[117] = "سنـون العجــوز 👵🏿✨" -- reply 

ws[118] = "عفيه" -- msg 
rs[118] = "اللـۿﮧ يعـافيـك 💖🌕" -- reply 

ws[119] = "بوت ملطلط" -- msg 
rs[119] = "مـو ملـطلـط مثـلك 🐿🐾" -- reply 

ws[120] = "امداك" -- msg 
rs[120] = "أتجـاوزك بسـرعتـي امـري للـۿﮧ ☃☄" -- reply 

ws[121] = "😔" -- msg 
rs[121] = "خطيـۿﮧ شبيـك منـو زعـلـۿﮧ ☃🍂" -- reply 

ws[122] = "🤔" -- msg 
rs[122] = "نـزل عيـنك اخـاف تنحـول 🐚🍁" -- reply 

ws[123] = "صلو عالنبي" -- msg 
rs[123] = "الـف الصـلاة ولسـلام علـى محمـد 💖🍂" -- reply 

ws[124] = "اذكرو الله" -- msg 
rs[124] = "الا بـذكـر اللـۿﮧ تطـمئن القـلـوب 💖✨" -- reply 

ws[125] = "كلخره" -- msg 
rs[125] = "خـره يتـرس حلـكك ختفـووو ابـلـع 💦✨" -- reply 

ws[126] = "كل خره" -- msg 
rs[126] = "خـرهه يتـرس حلـكـك ياخـرهه 🌝🐾" -- reply 

ws[127] = "امك شلونهه" -- msg 
rs[127] = "مثـل لـون امــك 🌕🎭" -- reply 

ws[128] = "هااي" 
rs[128] = "وعليـكم الهـاي 🍺✨" 

ws[129] = "كلخره" 
rs[129] = "خـرۿﮧ بحـلكك ختفــو ابـلـع 💦☄" 

ws[130] = "بوت" 
rs[130] = "نـعــالــۿﮧ 🌝🍷" 

ws[131] = "البوت" 
rs[131] = "نعـم تفـضل 🙇🏿" 

ws[132] = "المطور" 
rs[132] = "مطـور البـوت ➿💢\n 👾| @Dev_Gowad_BoT" 

ws[133] = "اي" 
rs[133] = "شنـو انـت مافهـمت شـي امشـطلعبـرا 😹🍃" 

ws[134] = "اريد بوت" 
rs[134] = "تريـد بـوت تعـال هنـا💠 \n 👾| @Dev_Gowad_Bot" 

-- the main function 
function DeVx7( msg, matches ) 
   -- just a local variables that i used in my algorithm 
   local i = 0; local w = false 

   -- the main part that get the message that the user send and check if it equals to one of the words in the ws table :) 
   -- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
   for k,v in pairs(ws) do 
      -- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
      if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then 
         -- assign the { i } to the index of the reply and the { w } to true ( we will use it later ) 
         i = k; w = true; 
      end 
   end 

   -- check if { w } is not false and { i } not equals to 0 
   if ( (w ~= false) and (i ~= 0) ) then 
      -- get the receiver :3 
      R = get_receiver(msg) 
      -- send him the proper message from the index that { i } assigned to 
      --send_large_msg ( R , rs[i] ); 
      --send_reply(msg.id, rs[i]) 
      reply_msg(msg.id, rs[i], ok_cb, false ) 
   end 
   -- don't edit this section 
   if ( msg.text == "about" ) then 
      if ( msg.from.username == "Memo" ) then 
         R = get_receiver(msg) 
         send_large_msg ( R , "Made by @AhMaD_x7 and @Gowad" ); 
      end 
   end 

end 

return { 
   patterns = { 
      "(.*)" 
     }, 
     run = DeVx7 
} 

end 
